Dlubal.RFEM5.DimensionObjectType
Type of dimension

Dlubal.RFEM5.DimensionObjectType.UnknownDimensionObjectType
Unknown type

Dlubal.RFEM5.DimensionObjectType.LinearObject
Linear dimension

Dlubal.RFEM5.DimensionObjectType.ArcLengthObject
Arc length

Dlubal.RFEM5.DimensionObjectType.AngularObject
Angular dimension

Dlubal.RFEM5.DimensionObjectType.RadialObject
Radial dimension

Dlubal.RFEM5.DimensionObjectType.SlopeObject
Slope dimension

Dlubal.RFEM5.DimensionObjectType.HeightObject
Height dimension